onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>net_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.net_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>net_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Начало net_Балабкина Е.А. 09.12.2025г.Задача2 Добавление на форму поле ввода скидки и кнопки расчета
	
	ГруппаСкидка = Элементы.Добавить("ГруппаШапка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		
	ПолеВвода = Элементы.Добавить("net_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.net_СогласованнаяСкидка"; 
	ПолеВвода.УстановитьДействие("ПриИзменении", "net_СогласованнаяСкидкаПриИзменении");
	
	Команда = Команды.Добавить("Пересчитать");
	Команда.Заголовок = "Пересчитать";
	Команда.Действие = "КомандаПересчитать";
	
	КнопкаФормы = Элементы.Добавить("КнопкаПересчитать", Тип("КнопкаФормы"), ГруппаСкидка);
	КнопкаФормы.ИмяКоманды = "Пересчитать";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Картинка = БиблиотекаКартинок.Перечитать; 
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаФормы.ПоложениеКартинки = ПоложениеКартинкиКнопкиФормы.Лево;
	
	//Конец net_Балабкина Е.А. 09.12.2025г.Задача2
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//Начало net_Балабкина Е.А. 09.12.2025г.Задача2 Строка кода закомментирована, т.к. не учитывает скидку по документу.
	//Исходный код:
	
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
    //ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;

	//Новый код расчета суммы по строке:

	Если ТекущиеДанные.Скидка + Объект.net_СогласованнаяСкидка <= 100 Тогда  
			
			ТекущиеДанные.Сумма = ТекущиеДанные.Цена * (1-(Объект.net_СогласованнаяСкидка+ТекущиеДанные.Скидка)/100) * ТекущиеДанные.Количество;

		Иначе
			
			ТекущиеДанные.Сумма = 0;
	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =  "В строке " + ТекущиеДанные.НомерСтроки + " " + ТекущиеДанные.Номенклатура + " суммарная скидка больше 100%";
			Сообщение.Сообщить();
						
		КонецЕсли;

    //Конец net_Балабкина Е.А. 09.12.2025г.Задача2

	
КонецПроцедуры

//Начало net_Балабкина Е.А. 09.12.2025г.Задача2 Процедура для расчета скидки при изменеии поля "Согласованная скидка"
 &НаКлиенте
 Асинх Процедура net_СогласованнаяСкидкаПриИзменении(Элемент)  
	
	
	Если Объект.Товары.Количество()<>0 ИЛИ Объект.Услуги.Количество()<>0  Тогда
		
		ТекстВопроса = "Изменён процент скидки. Пересчиать таблицы товаров и услуг?";
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
			 net_ИзменениеЦеныНаПроцентВТабличнойЧасти();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
  //Конец net_Балабкина Е.А. 09.12.2025г.Задача2 
  //Начало net_Балабкина Е.А. 09.12.2025г.Задача2 Расчет скидки при изменеии поля "Согласованная скидка" в таблицах "Товары" и "Услуги"
  &НаКлиенте
Процедура net_ИзменениеЦеныНаПроцентВТабличнойЧасти()
	
	net_ИзменениеЦеныНаПроцентВТабличнойЧастиДокумента(Объект.Товары);
    net_ИзменениеЦеныНаПроцентВТабличнойЧастиДокумента(Объект.Услуги);
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры
//Конец net_Балабкина Е.А. 09.12.2025г.Задача2 


//Начало net_Балабкина Е.А. 09.12.2025г.Задача2 Расчет скидки при изменеии поля "Согласованная скидка" непосредственно в таблице
&НаКлиенте
Процедура net_ИзменениеЦеныНаПроцентВТабличнойЧастиДокумента(Таблица)
	
	Для Каждого Строка Из Таблица Цикл  
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;

КонецПроцедуры
//Конец net_Балабкина Е.А. 09.12.2025г.Задача2

//Начало net_Балабкина Е.А. 09.12.2025г.Задача2 Обработка команды "Пересчитать"
&НаКлиенте
Процедура КомандаПересчитать(Команда)
	
		net_ИзменениеЦеныНаПроцентВТабличнойЧасти();
 
КонецПроцедуры
//Конец net_Балабкина Е.А. 09.12.2025г.Задача2

  


&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
